
#include "bms_ntc.h"

// 10K 3950 NTC电阻-温度表，其中阻值单位是Ω，也即-30℃时此NTC典型值阻值为182.46K
const uint32_t NTC_TABLE[QUERY_TABLE_LEN] =
{   182460, 171320, 160932, 151242, 142196, 133750, 125859, 118485, 111589, 105139, // -30℃~-21℃
    99102, 93450, 88156, 83195, 78544, 74183, 70091, 66250, 62643, 59255, // -20℃~-11℃
    56071, 53078, 50263, 47614, 45121, 42774, 40563, 38480, 36517, 34665, // -10℃~-1℃
    32919, 31270, 29715, 28246, 26858, 25547, 24307, 23135, 22026, 20977, // 0℃~9℃
    19987, 19044, 18154, 17310, 16510, 15752, 15034, 14352, 13705, 13090, // 10℃~19℃
    12507, 11953, 11427, 10927, 10452, 10000, 9570, 9161, 8771, 8401, // 20℃~29℃
    8048, 7712, 7391, 7086, 6795, 6518, 6254, 6001, 5761, 5531, // 30℃~39℃
    5311, 5102, 4902, 4710, 4528, 4353, 4186, 4026, 3874, 3728, // 40℃~49℃
    3588, 3454, 3326, 3203, 3085, 2973, 2865, 2761, 2662, 2567, // 50℃~59℃
    2476, 2388, 2304, 2223, 2146, 2072, 2000, 1932, 1866, 1803, // 60℃~69℃
    1742, 1684, 1627, 1573, 1521, 1471, 1423, 1377, 1332, 1289, // 70℃~79℃
    1248, 1208, 1170, 1133, 1097, 1063, 1030, 998, 968, 938, // 80℃~89℃
    909, 882, 855, 829, 805, 781, 758, 735, 714, 693, // 90℃~99℃
    673, 653, 635, 616, 599, 582, 565, 550, 534, 519, // 100℃~109℃
    505, 491, 478, 465, 452, 440, 428, 416, 405, 395, // 110℃~119℃
    384, 374, 364, 355, 345, 337, // 120℃~125℃
};

/// @brief 降序二分查找
/// @param array 
/// @param size 
/// @param target 
/// @return 
static uint16_t binarySearch(const uint32_t* array, uint16_t size, uint32_t target)
{
    uint16_t left = 0, right = size - 1;  // left, right 分别为两端端点
    
    while (left < right) {
        uint16_t mid = (right + left) / 2;  // 取中点坐标

        if (array[mid] == target)   // 检查中间元素是否是目标值
            return ((mid - 30) + 273.15f) * 100; // 若是，则匹配成功，返回温度值*100

        if (array[mid] < target)   // 如果目标值大于中间元素，忽略右半部分
            right = mid - 1;
        else                      // 如果目标值小于中间元素，忽略左半部分
            left = mid + 1;
    }

    // 当left == right时检查一次
    if(array[left] == target)
        return ((left - 30) + 273.15f) * 100;
    else
        return (1.0f * (array[left - 1] - array[left]) / (array[left - 1] - target) + left - 30 + 273.15f) * 100;
}


// 根据电阻计算NTC温度，返回实际温度（K）* 100（放大系数）
uint16_t NTC_res_calc_temp(float res)
{
    if(res * 1000 > NTC_TABLE[0])
        return (273.15f - 30) * 100;
    
    else if(res * 1000 < NTC_TABLE[QUERY_TABLE_LEN - 1])
        return (273.15f + 125) * 100;
    
    uint32_t target_res = res * 1000; // 阻值单位从KΩ转到Ω
    return binarySearch(NTC_TABLE, QUERY_TABLE_LEN, target_res);
}

